ЦентраАдминистрированияСервер/src/InformationRegisters/СостояниеИнформационныхБаз/СостояниеИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеИнформационныхБаз</name>
  <resources>
    <name>SQLБазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>SQLСерверБазДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>БлокировкаНачалаСеансов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПараметрыБлокировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРезервнойКопии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонфигурацияИзменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекущийРелиз</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МониторингОшибокСинхронизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЦентраАдминистрированияСервер/src/InformationRegisters/ЖурналСобытий/ЖурналСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналСобытий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЦентраАдминистрированияСервер/src/CommonModules/КонтрольИнформационныхБаз/Module.bsl
Процедура УстановитьСостояниеИнформационнойБазы(ИнформационнаяБаза, СтруктураСостояния) Экспорт
	
	НаборЗаписейСостоянияБаз = РегистрыСведений.СостояниеИнформационныхБаз.СоздатьНаборЗаписей();
	НаборЗаписейСостоянияБаз.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
	НаборЗаписейСостоянияБаз.Прочитать();
	Если НаборЗаписейСостоянияБаз.Количество() = 0 Тогда
		ЗаписьСостоянияБазы = НаборЗаписейСостоянияБаз.Добавить();
	Иначе
		ЗаписьСостоянияБазы = НаборЗаписейСостоянияБаз[0];
	КонецЕсли;
	ЗаписьСостоянияБазы.ИнформационнаяБаза = ИнформационнаяБаза; 
	
	ЗаполнитьЗначенияСвойств(ЗаписьСостоянияБазы, СтруктураСостояния);
	
	НаборЗаписейСостоянияБаз.Записать();
	
КонецПроцедуры

Процедура ЗаписатьСобытиеВЖурнал(ИнформационнаяБаза, Событие) Экспорт
	
	НаборЗаписейЖурналСобытий = РегистрыСведений.ЖурналСобытий.СоздатьНаборЗаписей();
	//НаборЗаписейЖурналСобытий.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
	//НаборЗаписейЖурналСобытий.Прочитать();
	
	ЗаписьЖурналаСобытий = НаборЗаписейЖурналСобытий.Добавить();
	ЗаписьЖурналаСобытий.Период = ТекущаяДата();
	ЗаписьЖурналаСобытий.ИнформационнаяБаза = ИнформационнаяБаза;
	ЗаписьЖурналаСобытий.Событие = Событие;
	
	НаборЗаписейЖурналСобытий.Записать(Ложь);
	
КонецПроцедуры
